src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                                     xmlns:us="http://hemonth.com/soap-example">
<soapenv:Header/>
<soapenv:Body>

    <us:getUserRequest>
        <us:name>peter</us:name>
    </us:getUserRequest>
</soapenv:Body>

</soapenv:Envelope>